"""
封装：将数据和方法组合在一起，隐藏内部实现细节，只暴露必要的接口，对外提供公共的访问方式
弊端：代码量增加
好处：提高代码的可维护性和可扩展性，增强代码的安全性。
格式：
    __属性
    __方法（）

多态：同一个方法可以有不同的实现方式，调用同一个方法时，实际执行的代码取决于对象的类型。
好处：提高代码的灵活性和可扩展性，减少代码重复，提高代码的可维护性。解耦合
弊端：可能会增加代码的复杂性，降低代码的可读性。无法精准限定类型

python中抽象类=接口

"""
class Animal:
    def eat(self):
        print("动物吃东西")

class Dog(Animal):
    def eat(self):
        print("狗吃骨头")

class Cat(Animal):
    def eat(self):
        print("猫吃鱼")

if __name__ == "__main__":
    dog = Dog()
    cat = Cat()

    # 多态：同一个方法名，不同的对象调用时，执行不同的代码
    dog.eat()  # 调用Dog类的eat方法
    cat.eat()  # 调用Cat类的eat方法
    #x